SSLD/3-3 3.18 Expression - Ideas 2 - Technical Tips.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* 3-3 3.18 Expression - Ideas 2 - Technical Tips
#+begin_verse
In this negotiation between two people,
	I'm wondering if you have any technical tips or strategies for
		how to express one's idea effectively to the other person?
		
We have talked about focusing on the other person's needs,
	and that is primary, primary, most important.
Other than that, one of the things that we want to be paying attention to is,
	are we using language or metaphors or illustrations
		that are easily understood by the other party?
Because we all grow up and got educated in different context,
	and sometimes we think that what we have taken for granted to be understood or easy
		may not be what the other person's idea of the same thing.
And we sometimes use simple examples like spending time together.
And so, one person's idea of spending time together
	can be totally different than another person's idea of what is spending time together.
So clarifying what we want to, communication is important.
It is also important to understand
	what the familiar language or metaphors that the other person is using.
	
I very often use this analogy.
If you're in early childhood education,
	for example, you want to be explaining some very complex ideas to younger children.
You sort of break it down into smaller parts
	and then you use metaphors that the child can understand.
And sometimes we are not preoccupied with the technical accuracy of what you're conveying.
If you're trying to explain the concept of time [LAUGH] to a young child,
	or you're trying to deal with epistemological issues.
	
I can give you a wonderful example.
I was out in Sichuan helping with the disaster relief after the 2008 earthquake,
	and I was in high school.
And this high school headmaster actually taught an epistemology class.
Some people don't even understand the word epistemology, which refers to the theory of knowledge.
And I asked, how do you teach grade six students?
They have a very different system there.
He said that I went to the classroom with an apple, and then I ask my students, what is this?
And they all say apple, so and then I ask them, so what is an apple?
And then they will say fruit.
And then he will, at that point, take the apple and then throw it at another student.
And then, so the student will take the apple and catch it,
	and then he'll ask the student, throw it to someone else.
And after a few rounds, he'll be asking the class again, so what is an apple?

Right. What is the apple now?
So he's using that to convey an idea.
And trying to use it within the context.
Why people would have a different language and metaphor,
	but they were getting this idea that an apple is not always a fruit.
The apple can also be a toy.
Therefore, in this case, can function like a ball.
So, you know, that is an example of how we utilize different language,
	metaphors, and circumstantial reality to convey ideas in a creative way.
#+end_verse
** expression
technical [ˈteknɪk(ə)l]: adj. technical language is language that is difficult for most people to understand because it is connected with one particular subject or used in one particular job技术的, 技术上的
strategy [ˈstrætədʒi]: n. a planned series of actions for achieving something策略
metaphor [ˈmetəˌfɔr]: n. a way of describing something by referring to it as something different and suggesting that it has similar qualities to that thing ⇨ simile暗喻, 比喻
illustrate [ˈɪləˌstreɪt] illustration: v.n. the act or process of illustrating something说明,举例说明
clarify [ˈklerɪˌfaɪ]: v. formal to make something clearer or easier to understand ⇨ clarification澄清, 阐明
epistemology [ɪˌpɪstə'mɒlədʒi]: n. [哲]认识论
convey [kənˈveɪ]: v. to communicate or express something, with or without using words传达
function [ˈfʌŋkʃ(ə)n]: v. if something functions in a particular way, it works in that way作用
circumstantial [ˌsɜrkəmˈstænʃ(ə)l]: adj. based on something that appears to be true but is not proven间接的
--------------------
Other than that, + ...: 除那之外
get educated: 接受教育
in different context: 在不同背景下
take sth. for granted to be done/adj.: 认为某事理所应当被../是...
break sth. down into smaller parts: 分解某物成更小的部分
be preoccupied with sth.: 专注于某事
After a few rounds, + ...: 几个回合后, ...
