English/SSLD/3-3 3.18 Expression - Ideas 2 - Technical Tips.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-05 Thu 22:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org0257cf1" class="outline-2">
<h2 id="org0257cf1">3-3 3.18 Expression - Ideas 2 - Technical Tips</h2>
<div class="outline-text-2" id="text-org0257cf1">
<p class="verse">
In this negotiation between two people,<br />
&#xa0;I'm wondering if you have any technical tips or strategies for<br />
&#xa0;&#xa0;how to express one's idea effectively to the other person?<br />
<br />
We have talked about focusing on the other person's needs,<br />
&#xa0;and that is primary, primary, most important.<br />
Other than that, one of the things that we want to be paying attention to is,<br />
&#xa0;are we using language or metaphors or illustrations<br />
&#xa0;&#xa0;that are easily understood by the other party?<br />
Because we all grow up and got educated in different context,<br />
&#xa0;and sometimes we think that what we have taken for granted to be understood or easy<br />
&#xa0;&#xa0;may not be what the other person's idea of the same thing.<br />
And we sometimes use simple examples like spending time together.<br />
And so, one person's idea of spending time together<br />
&#xa0;can be totally different than another person's idea of what is spending time together.<br />
So clarifying what we want to, communication is important.<br />
It is also important to understand<br />
&#xa0;what the familiar language or metaphors that the other person is using.<br />
<br />
I very often use this analogy.<br />
If you're in early childhood education,<br />
&#xa0;for example, you want to be explaining some very complex ideas to younger children.<br />
You sort of break it down into smaller parts<br />
&#xa0;and then you use metaphors that the child can understand.<br />
And sometimes we are not preoccupied with the technical accuracy of what you're conveying.<br />
If you're trying to explain the concept of time [LAUGH] to a young child,<br />
&#xa0;or you're trying to deal with epistemological issues.<br />
<br />
I can give you a wonderful example.<br />
I was out in Sichuan helping with the disaster relief after the 2008 earthquake,<br />
&#xa0;and I was in high school.<br />
And this high school headmaster actually taught an epistemology class.<br />
Some people don't even understand the word epistemology, which refers to the theory of knowledge.<br />
And I asked, how do you teach grade six students?<br />
They have a very different system there.<br />
He said that I went to the classroom with an apple, and then I ask my students, what is this?<br />
And they all say apple, so and then I ask them, so what is an apple?<br />
And then they will say fruit.<br />
And then he will, at that point, take the apple and then throw it at another student.<br />
And then, so the student will take the apple and catch it,<br />
&#xa0;and then he'll ask the student, throw it to someone else.<br />
And after a few rounds, he'll be asking the class again, so what is an apple?<br />
<br />
Right. What is the apple now?<br />
So he's using that to convey an idea.<br />
And trying to use it within the context.<br />
Why people would have a different language and metaphor,<br />
&#xa0;but they were getting this idea that an apple is not always a fruit.<br />
The apple can also be a toy.<br />
Therefore, in this case, can function like a ball.<br />
So, you know, that is an example of how we utilize different language,<br />
&#xa0;metaphors, and circumstantial reality to convey ideas in a creative way.<br />
</p>
</div>
<div id="outline-container-org7014f46" class="outline-3">
<h3 id="org7014f46">expression</h3>
<div class="outline-text-3" id="text-org7014f46">
<p>
technical [ˈteknɪk(ə)l]: adj. technical language is language that is difficult for most people to understand because it is connected with one particular subject or used in one particular job技术的, 技术上的<br />
strategy [ˈstrætədʒi]: n. a planned series of actions for achieving something策略<br />
metaphor [ˈmetəˌfɔr]: n. a way of describing something by referring to it as something different and suggesting that it has similar qualities to that thing ⇨ simile暗喻, 比喻<br />
illustrate [ˈɪləˌstreɪt] illustration: v.n. the act or process of illustrating something说明,举例说明<br />
clarify [ˈklerɪˌfaɪ]: v. formal to make something clearer or easier to understand ⇨ clarification澄清, 阐明<br />
epistemology [ɪˌpɪstə'mɒlədʒi]: n. [哲]认识论<br />
convey [kənˈveɪ]: v. to communicate or express something, with or without using words传达<br />
function [ˈfʌŋkʃ(ə)n]: v. if something functions in a particular way, it works in that way作用<br />
circumstantial [ˌsɜrkəmˈstænʃ(ə)l]: adj. based on something that appears to be true but is not proven间接的<br />
</p>
<hr />
<p>
Other than that, + &#x2026;: 除那之外<br />
get educated: 接受教育<br />
in different context: 在不同背景下<br />
take sth. for granted to be done/adj.: 认为某事理所应当被../是&#x2026;<br />
break sth. down into smaller parts: 分解某物成更小的部分<br />
be preoccupied with sth.: 专注于某事<br />
After a few rounds, + &#x2026;: 几个回合后, &#x2026;<br />
</p>
</div>
</div>
