English/SSLD/3-3 3.18 Expression - Ideas 2 - Technical Tips.html
<div id="outline-container-orgbe7e5b7" class="outline-3">
<h3 id="orgbe7e5b7">sentence</h3>
<div class="outline-text-3" id="text-orgbe7e5b7">
<p>
technical [ˈteknɪk(ə)l]: adj. technical language is language that is difficult for most people to understand because it is connected with one particular subject or used in one particular job技术的, 技术上的<br />
</p>
<ul class="org-ul">
<li>There are still some technical issues in this project, we have to delay in publishing it.<br /></li>
<li>Our manager put forward a plan existing some technical issues.<br /></li>
<li>I asked my uncle for some technical tips, but he hesitated to teach me a lesson.<br /></li>
</ul>
<p>
strategy [ˈstrætədʒi]: n. a planned series of actions for achieving something策略<br />
</p>
<ul class="org-ul">
<li>The police planned out the strategy for dealing with crime in the town to the last detail.<br /></li>
<li>Our essential strategy to pass the exam is by no other than learning knowledge.<br /></li>
<li>His strategy to overrun Winterfell proved to be effective.<br /></li>
</ul>
<p>
metaphor [ˈmetəˌfɔr]: n. a way of describing something by referring to it as something different and suggesting that it has similar qualities to that thing ⇨ simile暗喻, 比喻<br />
</p>
<ul class="org-ul">
<li>What a brilliant metaphor that has clarified the contents of the story.<br /></li>
<li>The metaphor is designed to teach children who can't understand complex ideas directly.<br /></li>
<li>Mr. Leo took the matphor for granted to be understood by his students. Obviously, it's not the case.<br /></li>
</ul>
<p>
illustrate [ˈɪləˌstreɪt] illustration: v.n. the act or process of illustrating something说明,举例说明<br />
</p>
<ul class="org-ul">
<li>Mr. Leo has a habit of illustrating ideas in his class when his students are comfused with them.<br /></li>
<li>The asterisk conducted him to a illustration in the next page.<br /></li>
<li>The combination of illustrations and experiments helps our student study in different dimensions.<br /></li>
</ul>
<p>
clarify [ˈklerɪˌfaɪ]: v. formal to make something clearer or easier to understand ⇨ clarification澄清, 阐明<br />
</p>
<ul class="org-ul">
<li>The knight had to clarify the fact that the princess hadn't committed suicide because she was betrothed to a crippled.<br /></li>
<li>Consequently, our king failed to clarify whether this boy is his bastard or not.<br /></li>
<li>Realizing that he couldn't clarify the crime, he went abroad secretly.<br /></li>
</ul>
<p>
convey [kənˈveɪ]: v. to communicate or express something, with or without using words传达<br />
</p>
<ul class="org-ul">
<li>What your wife was conveying yesterday may be the idea of going to a shopping mall.<br /></li>
<li>The message will be conveyed to King's Landing, five thousands miles away, in three days.<br /></li>
<li>The day before being betrothed to a mutilated lord, the princess sent her knights off to convery her love to the general.<br /></li>
</ul>
<p>
function [ˈfʌŋkʃ(ə)n]: v. if something functions in a particular way, it works in that way作用<br />
</p>
<ul class="org-ul">
<li>The blanket now functions as my cat's nest in winter.<br /></li>
<li>The apple that functioned like a ball was being throwing between students.<br /></li>
<li>The mutilated coat hangers function as fuel in the fireplace.<br /></li>
</ul>
<p>
circumstantial [ˌsɜrkəmˈstænʃ(ə)l]: adj. based on something that appears to be true but is not proven间接的<br />
</p>
<ul class="org-ul">
<li>He is naive enough to believe that circumstantial evidences can prove a lord's crime.<br /></li>
<li>Circumstantial evidences show us that the shape of molecule is a pyramid.<br /></li>
<li>Because of these circumstantial evidences, the elf will never give up hunting for Sauron.<br /></li>
</ul>
<hr />
<p>
Other than that, + &#x2026;: 除那之外<br />
</p>
<ul class="org-ul">
<li>Other than that, Winterfell is the outermost city from the Seven Kingdom.<br /></li>
<li>Other than that, Sansa is not a virgin because she got married to the king, Renly.<br /></li>
<li>Other than that, like charges will try to minmize the repulsion between each other.<br /></li>
</ul>
<p>
get educated: 接受教育<br />
</p>
<ul class="org-ul">
<li>He can't make friends with this immigrants who got educated in different culture.<br /></li>
<li>He has an idead of having his child get educated in the town.<br /></li>
<li>Getting educated abord in his youth, he can't get along with people around when he's home.<br /></li>
</ul>
<p>
in different context: 在不同背景下<br />
</p>
<ul class="org-ul">
<li>A single word may have different meaning in different context.<br /></li>
<li>Although getting edcucated in different context, they both have a merciful heart.<br /></li>
<li>It's difficult to imagine that people in different context are bunched up together in the castle.<br /></li>
</ul>
<p>
take sth. for granted to be done/adj.: 认为某事理所应当被../是&#x2026;<br />
</p>
<ul class="org-ul">
<li>My wife is always taking a good job for granted to be found in the context.<br /></li>
<li>He takes her love for granted to be selfless.<br /></li>
<li>My cat seems to take her food for granted to be offered on time.<br /></li>
</ul>
<p>
break sth. down into smaller parts: 分解某物成更小的部分<br />
</p>
<ul class="org-ul">
<li>Even if he broke his father precious clock down into smaller parts and it was broken, his father hadn't blamed him.<br /></li>
<li>The clock that was broken down into smaller parts can't be assembled together anymore.<br /></li>
<li>The boy has a habit of breaking his clock down into smaller parts on Saturday and assembling them together on the next day.<br /></li>
</ul>
<p>
be preoccupied with sth.: 专注于某事<br />
</p>
<ul class="org-ul">
<li>Preoccupied with his work, he missed the meeting in which he was promoted as the new leader.<br /></li>
<li>Preoccupied with his homework, he didn't answer his mother's call.<br /></li>
<li>Preoccupied with the details, he can't form a complete picture of labyrinth.<br /></li>
</ul>
<p>
After a few rounds, + &#x2026;: 几个回合后, &#x2026;<br />
</p>
<ul class="org-ul">
<li>After a few rounds, the knight was knocked to the ground.<br /></li>
<li>After a few rounds, my cat can't be bothered to go to bed.<br /></li>
<li>After a few rounds, the local grocer agreed to do me a favor.<br /></li>
</ul>
</div>
</div>
